tutorials/fastDuct/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       fastfoam;

libs              ("libuserfiniteVolume.so");

startFrom         startTime;

startTime         0.0;

stopAt            endTime;

endTime           0.1;

deltaT            0.02;

writeControl      adjustableRunTime;

writeInterval     0.04; 

purgeWrite        0;

writeFormat       binary;
//writeFormat       ascii;

writePrecision    12;

//writeCompression  compressed;
writeCompression  uncompressed;

timeFormat        general;

timePrecision     12;

runTimeModifiable yes;

adjustTimeStep    no;

maxCo             0.75;

maxDeltaT         25.0;

functions
{
}
