tutorials/fastDuct/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.uniform;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 8.0 0 0 );

boundaryField
{
    bottom
    {
      type cyclic;
    }
 
    top
    {
      type cyclic;
    }

    west
    {
      type            fixedValue;
      value           uniform ( 8.0 0 0 );
    }

    east
    {
      type            zeroGradient;
    }

    north
    {
      type cyclic;
    }

    south
    {
      type cyclic;
    }
}


// ************************************************************************* //
